content/journal/2024-08-18.org
---
title: Blood Avatars  and Council Paperwork
date: 2024-08-18T15:20:17-07:00
draft: false
---
* Waking Up
** Geisthal's Card
- Metal
- Silver grin drawn on it
- We can talk to Geisthal through it
- Geisthal confirmed they can move through time and space
- TODO: Read Geisthall's mind and create a paradox with future knowledge
- TODO: I have a card for the Curse Store. Can I telegram them or anything?
- Geisthal is being pursued by evil adversaries, they should get back to us in a day about investigating and removing the curse
- Is Geisthal being chased by werewolves or some kind of eldritch dog? We heard a howl
** Vampirism
- Everything hurts
- We need alchemy tools to brew a blood substitute
- From eating blood: Flight, turning into animals, hypnosis, climbing
- Animal or non-lethally extracted blood sates hunger but brings no powers
** Geisthal
- Covered in blue blood
- Blood is not from the material plane
- He gave us an alchemy set in return for the book on artefacts
- Geisthal leaves the dogs to us
- The blood: Hound of Tindalos. Extradimensional being that goes after being who violate the laws of time
- So don't go reading Geisthal's mind
*** Curse Insight
- Someone abused the thing, got too many uses out of it, Spider cursed it in annoyance
- It's polluted with evil magic, we need to remove that before she'll even consider removing the curse
* Throldum
- Lumber colony
- Former trade metropolis
- Massacre took place here, from the documents
** Running about
- Zy runs off into the forest
- Margaret stays back to do science
- Lots of plant life
- No birds or bugs
- Noises up ahead: A dying animal
- Big wooden wall, sharp points on top, keep people and animals out
- Two large elephants, one dying (the parent) and the other (child) pushing at it.
** Vampire Country
- A year ago, a massacre (Kiordan) happened here
- Two days ago (masquerade day), vamps were roaming the area sucking elephant and other blood
- Something was trying to escape from inside the wall, digging a hole through with their fingers, they died, no blood in their fingers
** Scaling the wall
- There are hundreds of people, pale grey, stacked against the wall.
- Dead, heads pulled back, as if they were fleeing something
- Eyes are missing
- Around 100 people
- Top of a tall statue with arms stretched outward
- Building: Town Hall
** Investigations
- Eyes exploded from the back of skull
- Conjecture: Some kind of brain damage? From too much mindfuckery?
- The gate closed behind us
- 3 figures atop the roofs
- They haven't noticed us.
** Statue/Column
- Base: Depiction of a bunch of people wailing and blood flowing across the surface of the statue, out of people's eyes/mouths/ears/noses
- Higher: People catching the blood and handing it higher up
- Very top: Statue of a woman, her arms outstretched, fangs beared.
- Figure named Zura, don't recall much else. Probably a vampire goddess though
- Smaller figure with arms outstretched: A figure who looks a lot like Margaret.
- She's adorned to look very similar to Zura, perhaps an avatar or scion?
- Demon lords tend to have incarnations through another being.
*** Statue Fight
- Blood flowing up the statue: It bubbles and shifts as we leave
- The blood is fresh
- An arm reaches out as if from behind the blood, pulls itself up and out.
- A vaguely Zura-looking 9-foot blood-figure emerges, wearing a crown and long flowing dress
- The statue is a blood avatar, weak to cold and electricity.
- But electricity damage hastens/quickens it.
- We learned that ripping blood out of something's head with weird magic causes its eyes to pop out.
- So conjecture that this is what the column did to everyone in the city.
- But how did the statue get here?
- After we beat the blood avatar, the column starts shaking and we get weird vibes
- Zyzyx recognises it: In 10 minutes, it'll begin a blood drain effect. Draw the blood out of the entire city, and rebuild the avatar with that.
- The ghost-things on Edalyn don't have a brain
- We escaped the blood drain effect, with help from Margaret and an elephant
- Margaret knows the dark crystal (at least in part),
** Town Hall
- Found a crystal in the doorway, Lyn took it
- Found some documents in a safe, and also Iggly stole some valuables
- The crystal: Fennec knows what it is, but in-character I don't know that
- Geisthal bought it from us, in return for unspecified favors for both the group and Fennec specifically
- Crystal: Blood jewel, formed from the blood of thousands. Vampiric currency and power-food
- He seems to be telling the truth that it can't help with reversing
- Geisthal has extraplanar plans with it
* Document insights
- 40 yrs ago, fell on hard times
- Wasn't bringing in enough food, etc.
- Suddenly, Geb emissary shows up (on behalf of Kiordan).
- Bolsters economy, in exchange for a small tax with interest
- Suddenly town is thriving, resources and business flow in from Dawnfall
- And then, odd stuff happens
** Odd Stuff
- Cult sets up shop!
- Town debated, let cult slide because Dawnfall money
- Around 20 years ago:
- Cult built the column
- Kiordan and his wife had plans for official visit
- No more logs after the Kiordan visit from 20yrs ago
- Around this time, Kiordan's wife goes missing
- Per Margaret's memories: 30 years since she fled, or so.
- So 30yrs since Margaret ran off, and 20yrs since Kiordan's wife's dissapearance became public
- One more thing: 50 years ago, an ancient relic was discovered and held in a vault deep within the town hall.
- So the tablet was originally held here.
- So 50 years ago: Tablet was locked away. 40 years ago: Geb showed up and started meddling
- So Kiordan's plans of "get the tablet, do murder, and then spotless mind it" dates back to 40 years
* Fennec's Secret: Paper from an old blind man
Step 1: Know true name
Step 2: Speak true name
Step 3: ???
Step 4: Profit
