public/journal/2024-08-18/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <meta http-equiv="X-Clacks-Overhead" content="GNU Terry Pratchett" />
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>Tholdrum: Blood Avatars and Council Paperwork | Genevieve&#39;s Journal</title>
<meta name="title" content="Tholdrum: Blood Avatars and Council Paperwork" />
<meta name="description" content="Waking Up Geisthal&#39;s Card Metal Silver grin drawn on it We can talk to Geisthal through it Geisthal confirmed they can move through time and space TODO: Read Geisthall&#39;s mind and create a paradox with future knowledge TODO: I have a card for the Curse Store. Can I telegram them or anything? Geisthal is being pursued by evil adversaries, they should get back to us in a day about investigating and removing the curse Is Geisthal being chased by werewolves or some kind of eldritch dog?" />
<meta name="author" content="" />
<meta name="keywords" content="" />






  
  <meta property="og:url" content="https://vivianwilde.github.io/blogletters/journal/2024-08-18/">
  <meta property="og:site_name" content="Genevieve&#39;s Journal">
  <meta property="og:title" content="Tholdrum: Blood Avatars and Council Paperwork">
  <meta property="og:description" content="Waking Up Geisthal&#39;s Card Metal Silver grin drawn on it We can talk to Geisthal through it Geisthal confirmed they can move through time and space TODO: Read Geisthall&#39;s mind and create a paradox with future knowledge TODO: I have a card for the Curse Store. Can I telegram them or anything? Geisthal is being pursued by evil adversaries, they should get back to us in a day about investigating and removing the curse Is Geisthal being chased by werewolves or some kind of eldritch dog?">
  <meta property="og:locale" content="en_us">
  <meta property="og:type" content="article">
    <meta property="article:section" content="journal">
    <meta property="article:published_time" content="2024-08-18T15:20:17-07:00">
    <meta property="article:modified_time" content="2024-08-18T15:20:17-07:00">


  
  
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="Tholdrum: Blood Avatars and Council Paperwork">
  <meta name="twitter:description" content="Waking Up Geisthal&#39;s Card Metal Silver grin drawn on it We can talk to Geisthal through it Geisthal confirmed they can move through time and space TODO: Read Geisthall&#39;s mind and create a paradox with future knowledge TODO: I have a card for the Curse Store. Can I telegram them or anything? Geisthal is being pursued by evil adversaries, they should get back to us in a day about investigating and removing the curse Is Geisthal being chased by werewolves or some kind of eldritch dog?">


  
  
  <meta itemprop="name" content="Tholdrum: Blood Avatars and Council Paperwork">
  <meta itemprop="description" content="Waking Up Geisthal&#39;s Card Metal Silver grin drawn on it We can talk to Geisthal through it Geisthal confirmed they can move through time and space TODO: Read Geisthall&#39;s mind and create a paradox with future knowledge TODO: I have a card for the Curse Store. Can I telegram them or anything? Geisthal is being pursued by evil adversaries, they should get back to us in a day about investigating and removing the curse Is Geisthal being chased by werewolves or some kind of eldritch dog?">
  <meta itemprop="datePublished" content="2024-08-18T15:20:17-07:00">
  <meta itemprop="dateModified" content="2024-08-18T15:20:17-07:00">
  <meta itemprop="wordCount" content="957">

<meta name="referrer" content="no-referrer-when-downgrade" />

  
  <link href="/blogletters/original.min.css" rel="stylesheet">

  

  

  
</head>

<body>
  <header><a class="skip-link" href="#main-content">Skip to main content</a>

<a href="/blogletters/" class="title"><h1>Genevieve&#39;s Journal</h1></a>
<nav>
  <a href="/blogletters/journal">Journal</a>

  <a href="/blogletters/threads">Quest Threads</a>

  <a href="/blogletters/about">About</a>









</nav>
</header>
  <main id="main-content">

<h1>Tholdrum: Blood Avatars and Council Paperwork</h1>
<p class="byline">
  <time datetime='2024-08-18' pubdate>
    2024-08-18
  </time>
  
</p>

<content>
  
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Waking Up
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Geisthal&#39;s Card
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<ul>
<li>Metal</li>
<li>Silver grin drawn on it</li>
<li>We can talk to Geisthal through it</li>
<li>Geisthal confirmed they can move through time and space</li>
<li>TODO: Read Geisthall&#39;s mind and create a paradox with future knowledge</li>
<li>TODO: I have a card for the Curse Store. Can I telegram them or anything?</li>
<li>Geisthal is being pursued by evil adversaries, they should get back to us in a day about investigating and removing the curse</li>
<li>Is Geisthal being chased by werewolves or some kind of eldritch dog? We heard a howl</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Vampirism
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li>Everything hurts</li>
<li>We need alchemy tools to brew a blood substitute</li>
<li>From eating blood: Flight, turning into animals, hypnosis, climbing</li>
<li>Animal or non-lethally extracted blood sates hunger but brings no powers</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Geisthal
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>Covered in blue blood</li>
<li>Blood is not from the material plane</li>
<li>He gave us an alchemy set in return for the book on artefacts</li>
<li>Geisthal leaves the dogs to us</li>
<li>The blood: Hound of Tindalos. Extradimensional being that goes after being who violate the laws of time</li>
<li>So don&#39;t go reading Geisthal&#39;s mind</li>
</ul>
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
Curse Insight
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<ul>
<li>Someone abused the thing, got too many uses out of it, Spider cursed it in annoyance</li>
<li>It&#39;s polluted with evil magic, we need to remove that before she&#39;ll even consider removing the curse</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Throldum
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<ul>
<li>Lumber colony</li>
<li>Former trade metropolis</li>
<li>Massacre took place here, from the documents</li>
</ul>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Running about
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li>Zy runs off into the forest</li>
<li>Margaret stays back to do science</li>
<li>Lots of plant life</li>
<li>No birds or bugs</li>
<li>Noises up ahead: A dying animal</li>
<li>Big wooden wall, sharp points on top, keep people and animals out</li>
<li>Two large elephants, one dying (the parent) and the other (child) pushing at it.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Vampire Country
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ul>
<li>A year ago, a massacre (Kiordan) happened here</li>
<li>Two days ago (masquerade day), vamps were roaming the area sucking elephant and other blood</li>
<li>Something was trying to escape from inside the wall, digging a hole through with their fingers, they died, no blood in their fingers</li>
</ul>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Scaling the wall
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<ul>
<li>There are hundreds of people, pale grey, stacked against the wall.</li>
<li>Dead, heads pulled back, as if they were fleeing something</li>
<li>Eyes are missing</li>
<li>Around 100 people</li>
<li>Top of a tall statue with arms stretched outward</li>
<li>Building: Town Hall</li>
</ul>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Investigations
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<ul>
<li>Eyes exploded from the back of skull</li>
<li>Conjecture: Some kind of brain damage? From too much mindfuckery?</li>
<li>The gate closed behind us</li>
<li>3 figures atop the roofs</li>
<li>They haven&#39;t noticed us.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Statue/Column
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<ul>
<li>Base: Depiction of a bunch of people wailing and blood flowing across the surface of the statue, out of people&#39;s eyes/mouths/ears/noses</li>
<li>Higher: People catching the blood and handing it higher up</li>
<li>Very top: Statue of a woman, her arms outstretched, fangs beared.</li>
<li>Figure named Zura, don&#39;t recall much else. Probably a vampire goddess though</li>
<li>Smaller figure with arms outstretched: A figure who looks a lot like Margaret.</li>
<li>She&#39;s adorned to look very similar to Zura, perhaps an avatar or scion?</li>
<li>Demon lords tend to have incarnations through another being.</li>
</ul>
<div id="outline-container-headline-12" class="outline-4">
<h4 id="headline-12">
Statue Fight
</h4>
<div id="outline-text-headline-12" class="outline-text-4">
<ul>
<li>Blood flowing up the statue: It bubbles and shifts as we leave</li>
<li>The blood is fresh</li>
<li>An arm reaches out as if from behind the blood, pulls itself up and out.</li>
<li>A vaguely Zura-looking 9-foot blood-figure emerges, wearing a crown and long flowing dress</li>
<li>The statue is a blood avatar, weak to cold and electricity.</li>
<li>But electricity damage hastens/quickens it.</li>
<li>We learned that ripping blood out of something&#39;s head with weird magic causes its eyes to pop out.</li>
<li>So conjecture that this is what the column did to everyone in the city.</li>
<li>But how did the statue get here?</li>
<li>After we beat the blood avatar, the column starts shaking and we get weird vibes</li>
<li>Zyzyx recognises it: In 10 minutes, it&#39;ll begin a blood drain effect. Draw the blood out of the entire city, and rebuild the avatar with that.</li>
<li>The ghost-things on Edalyn don&#39;t have a brain</li>
<li>We escaped the blood drain effect, with help from Margaret and an elephant</li>
<li>Margaret knows the dark crystal (at least in part),</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Town Hall
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<ul>
<li>Found a crystal in the doorway, Lyn took it</li>
<li>Found some documents in a safe, and also Iggly stole some valuables</li>
<li>The crystal: Fennec knows what it is, but in-character I don&#39;t know that</li>
<li>Geisthal bought it from us, in return for unspecified favors for both the group and Fennec specifically</li>
<li>Crystal: Blood jewel, formed from the blood of thousands. Vampiric currency and power-food</li>
<li>He seems to be telling the truth that it can&#39;t help with reversing</li>
<li>Geisthal has extraplanar plans with it</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
Document insights
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<ul>
<li>40 yrs ago, fell on hard times</li>
<li>Wasn&#39;t bringing in enough food, etc.</li>
<li>Suddenly, Geb emissary shows up (on behalf of Kiordan).</li>
<li>Bolsters economy, in exchange for a small tax with interest</li>
<li>Suddenly town is thriving, resources and business flow in from Dawnfall</li>
<li>And then, odd stuff happens</li>
</ul>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
Odd Stuff
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<ul>
<li>Cult sets up shop!</li>
<li>Town debated, let cult slide because Dawnfall money</li>
<li>Around 20 years ago:</li>
<li>Cult built the column</li>
<li>Kiordan and his wife had plans for official visit</li>
<li>No more logs after the Kiordan visit from 20yrs ago</li>
<li>Around this time, Kiordan&#39;s wife goes missing</li>
<li>Per Margaret&#39;s memories: 30 years since she fled, or so.</li>
<li>So 30yrs since Margaret ran off, and 20yrs since Kiordan&#39;s wife&#39;s dissapearance became public</li>
<li>One more thing: 50 years ago, an ancient relic was discovered and held in a vault deep within the town hall.</li>
<li>So the tablet was originally held here.</li>
<li>So 50 years ago: Tablet was locked away. 40 years ago: Geb showed up and started meddling</li>
<li>So Kiordan&#39;s plans of &#34;get the tablet, do murder, and then spotless mind it&#34; dates back to 40 years</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-16" class="outline-2">
<h2 id="headline-16">
Fennec&#39;s Secret: Paper from an old blind man
</h2>
<div id="outline-text-headline-16" class="outline-text-2">
<p>Step 1: Know true name
Step 2: Speak true name
Step 3: ???
Step 4: Profit</p>
</div>
</div>

</content>
<p>
  
</p>




  </main>
  <footer><small>
   | 
</small></footer>

    
</body>

</html>
